app/views/evaluations/index.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
        <td><%= evaluation.project_description %></td>
        <td><%= Course.find(Group.find(evaluation.group_id).course_id).course_name %></td>
        <td>
        <%= Student.find(evaluation.student_id).first_name %> <%= Student.find(evaluation.student_id).last_name %>
        </td>
        <td><%= link_to Group.find(evaluation.group_id).group_name, Group.find(evaluation.group_id) %></td>

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? ORDER BY "instructors"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
    <% @evaluations.each do |evaluation| %>
      <% if current_instructor.id == Course.find(Group.find(evaluation.group_id).course_id).instructor_id %>

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
        <td><%= evaluation.project_description %></td>
        <td><%= Course.find(Group.find(evaluation.group_id).course_id).course_name %></td>
        <td>
        <%= Student.find(evaluation.student_id).first_name %> <%= Student.find(evaluation.student_id).last_name %>
        </td>
        <td><%= link_to Group.find(evaluation.group_id).group_name, Group.find(evaluation.group_id) %></td>