app/views/groups/_form.html.erb

SELECT "students".* FROM "students"
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 3]]
---
      <tbody>
        <% Student.all.each do |student| %>
          <% #get_current_course THIS IS BAD CODE HERE. NO CURRENT COURSE%>
          <% if get_current_course.students.any? { |current| current.email == student.email } && group.students.none? { |current| current.email == student.email } %>