app/views/groups/index.html.erb

      <tr>
        <td><%= link_to group.group_name, group %></td>
        <td><%= Course.find(group.course_id).course_name %></td>
        <td><%= group.course_id %></td>
        <td><%= Instructor.find(Course.find(group.course_id).instructor_id).last_name %></td>
        <td>
        <%group.students.each do |stud| %>
---
SELECT "groups".* FROM "groups"
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? ORDER BY "instructors"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "groups_students" ON "students"."id" = "groups_students"."student_id" WHERE "groups_students"."group_id" = ?  [["group_id", 15]]

      </tr>
      <% elsif group.course.id == get_current_course.id && group.students.any? { |current| current.email == current_student.email } %>
---
SELECT 1 AS one FROM "students" INNER JOIN "groups_students" ON "students"."id" = "groups_students"."student_id" WHERE "groups_students"."group_id" = ? AND "students"."id" = ? LIMIT ?  [["group_id", 1], ["id", 6], ["LIMIT", 1]]

    <% @groups.each do |group| %>
    <% if group.students.include? current_student %>
      <tr>
        <td><%= link_to group.group_name, group %></td>
        <td><%= Course.find(group.course_id).course_name %></td>
        <td><%= group.course_id %></td>
        <td><%= Instructor.find(Course.find(group.course_id).instructor_id).last_name %></td>
        <td>
        <%group.students.each do |stud| %>
---
SELECT 1 AS one FROM "students" INNER JOIN "groups_students" ON "students"."id" = "groups_students"."student_id" WHERE "groups_students"."group_id" = ? AND "students"."id" = ? LIMIT ?  [["group_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "groups_students" ON "students"."id" = "groups_students"."student_id" WHERE "groups_students"."group_id" = ?  [["group_id", 17]]