app/views/groups/show.html.erb


    <% if @group.students.include? current_student %>
      <tr>
        <td><%= Course.find(@group.course_id).course_name %></td>
        <td><%= @group.course_id %></td>
        <td><%= Instructor.find(Course.find(@group.course_id).instructor_id).last_name %></td>
        <td>
        <% @group.students.each do |stud| %>
---
SELECT "students".* FROM "students" INNER JOIN "groups_students" ON "students"."id" = "groups_students"."student_id" WHERE "groups_students"."group_id" = ?  [["group_id", 17]]
SELECT 1 AS one FROM "students" INNER JOIN "groups_students" ON "students"."id" = "groups_students"."student_id" WHERE "groups_students"."group_id" = ? AND "students"."id" = ? LIMIT ?  [["group_id", 17], ["id", 6], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

      <tr>
        <td><%= Course.find(@group.course_id).course_name %></td>
        <td><%= @group.course_id %></td>
        <td><%= Instructor.find(Course.find(@group.course_id).instructor_id).last_name %></td>
        <td>
        <% @group.students.each do |stud| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "groups_students" ON "students"."id" = "groups_students"."student_id" WHERE "groups_students"."group_id" = ?  [["group_id", 18]]