app/views/courses/_form.html.erb

SELECT "students".* FROM "students"
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 4]]
---
      <tbody>
        <% Student.all.each do |student| %>
          <% if course.students.none? { |current| current.email == student.email } %>

SELECT "students".* FROM "students"
---
      <tbody>
        <% Student.all.each do |student| %>