app/views/courses/index.html.erb

<% if current_student %>
<h2>Student: <%= (Student.find(current_student.id)).email %></h2>
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

<% if current_instructor %>
<h2>Instructor: <%= (Instructor.find(current_instructor.id)).email %></h2>
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    <% @courses.each do |course| %>
      <% Student.all.each do |studentTest| %>
      <% if course.students.any? { |current| current.email == studentTest.email } %>
---
SELECT "students".* FROM "students"
SELECT 1 AS one FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ? AND "students"."id" = ? LIMIT ?  [["course_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 1]]

        <td>
        <% Instructor.all.each do |ins| %>
---
SELECT "instructors".* FROM "instructors"

        <td>
        <% Student.all.each do |student| %>
          <% if course.students.any? { |current| current.email == student.email } %>
---
SELECT "students".* FROM "students"

        <td>
        <% Instructor.all.each do |ins| %>
---
SELECT "instructors".* FROM "instructors"

        <td>
        <% Student.all.each do |student| %>
          <% if course.students.any? { |current| current.email == student.email } %>
---
SELECT "students".* FROM "students"
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 9]]