app/views/courses/show.html.erb

SELECT "students".* FROM "students"
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 9]]
---
  <tbody>
    <% Student.all.each do |student| %>
      <% if @course.students.any? { |current| current.email == student.email } %>