app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def show
    @current_course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @course = Course.new(course_params)
    @course.instructor = current_instructor

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("course_name", "created_at", "updated_at", "instructor_id", "semester") VALUES (?, ?, ?, ?, ?)  [["course_name", "CSE3901"], ["created_at", "2021-04-22 17:40:37.977462"], ["updated_at", "2021-04-22 17:40:37.977462"], ["instructor_id", 4], ["semester", "Fall 2021"]]

  def destroy
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 5]]

    def set_course
      @course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def add_students params
      if params[:add]
        params[:add].each do |email|
          @course.students.push Student.where(email: email)
        end
      end
      if params[:remove]
        params[:remove].each do |email|
          @course.students.delete Student.where(email: email)
---
SELECT "students".* FROM "students" WHERE "students"."email" = ?  [["email", "k@k.com"]]