app/controllers/evaluations_controller.rb

SELECT "evaluations".* FROM "evaluations"
---
  def index
    @evaluations = Evaluation.all

SELECT "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "evaluations" ("leadership_score", "communication_score", "contribution_score", "quality_score", "skills_score", "comment", "created_at", "updated_at", "student_id", "group_id", "project_description") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @evaluation = Evaluation.new(evaluation_params)
    #@evaluation.student_id = current_student.id
    #TODO fix me BAD
    #@evaluation.project_id = Project.first.id
    @evaluation.group_id = get_current_group.id
    respond_to do |format|
      if @evaluation.save

UPDATE "evaluations" SET "updated_at" = ?, "project_description" = ? WHERE "evaluations"."id" = ?  [["updated_at", "2021-04-23 19:49:29.553098"], ["project_description", "f"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @evaluation.update(evaluation_params)

DELETE FROM "evaluations" WHERE "evaluations"."id" = ?  [["id", 2]]
---
  def destroy
    @evaluation.destroy

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_evaluation
      @evaluation = Evaluation.find(params[:id])