app/controllers/groups_controller.rb

INSERT INTO "groups" ("group_name", "created_at", "updated_at", "course_id") VALUES (?, ?, ?, ?)  [["group_name", "rrr"], ["created_at", "2021-04-23 12:12:14.799109"], ["updated_at", "2021-04-23 12:12:14.799109"], ["course_id", 1]]
---
  def create
    @group = Group.new(group_params)
    #@group.course = get_current_course BAD BAD
    @group.course = get_current_course

    respond_to do |format|
      if @group.save

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 13]]
---
  def destroy
    @group.destroy

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def set_group
      @group = Group.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."email" = ?  [["email", "k@k.com"]]
---
    def add_students params
      if params[:input]
        params[:input].each do |email|
          @group.students.push Student.where(email: email)