app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.all

INSERT INTO "projects" ("project_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["project_name", "u"], ["created_at", "2021-04-23 11:34:06.479513"], ["updated_at", "2021-04-23 11:34:06.479513"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_project
      @project = Project.find(params[:id])