app/controllers/responses_controller.rb

SELECT "responses".* FROM "responses"
---
  def index
    @responses = Response.all